###############################################################################
# Created by write_sdc
###############################################################################
current_design ctu_can
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 15.0000 [get_ports {clk_sys}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2000 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[0]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[0]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[10]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[10]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[11]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[11]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[12]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[12]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[13]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[13]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[14]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[14]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[15]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[15]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[1]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[1]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[2]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[2]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[3]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[3]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[4]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[4]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[5]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[5]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[6]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[6]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[7]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[7]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[8]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[8]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {adress[9]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {adress[9]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {can_rx}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {can_rx}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[0]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[0]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[10]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[10]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[11]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[11]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[12]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[12]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[13]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[13]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[14]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[14]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[15]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[15]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[16]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[16]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[17]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[17]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[18]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[18]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[19]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[19]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[1]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[1]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[20]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[20]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[21]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[21]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[22]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[22]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[23]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[23]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[24]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[24]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[25]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[25]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[26]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[26]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[27]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[27]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[28]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[28]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[29]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[29]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[2]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[2]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[30]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[30]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[31]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[31]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[3]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[3]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[4]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[4]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[5]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[5]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[6]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[6]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[7]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[7]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[8]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[8]}]
set_input_delay 0.2000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_in[9]}]
set_input_delay 1.2000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_in[9]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {res_n}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {res_n}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sbe[0]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {sbe[0]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sbe[1]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {sbe[1]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sbe[2]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {sbe[2]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {sbe[3]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {sbe[3]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {scs}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {scs}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {srd}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {srd}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {swr}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {swr}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[0]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[0]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[10]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[10]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[11]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[11]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[12]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[12]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[13]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[13]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[14]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[14]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[15]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[15]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[16]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[16]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[17]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[17]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[18]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[18]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[19]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[19]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[1]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[1]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[20]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[20]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[21]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[21]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[22]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[22]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[23]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[23]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[24]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[24]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[25]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[25]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[26]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[26]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[27]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[27]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[28]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[28]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[29]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[29]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[2]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[2]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[30]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[30]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[31]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[31]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[32]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[32]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[33]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[33]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[34]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[34]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[35]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[35]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[36]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[36]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[37]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[37]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[38]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[38]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[39]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[39]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[3]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[3]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[40]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[40]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[41]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[41]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[42]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[42]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[43]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[43]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[44]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[44]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[45]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[45]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[46]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[46]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[47]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[47]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[48]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[48]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[49]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[49]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[4]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[4]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[50]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[50]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[51]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[51]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[52]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[52]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[53]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[53]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[54]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[54]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[55]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[55]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[56]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[56]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[57]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[57]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[58]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[58]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[59]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[59]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[5]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[5]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[60]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[60]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[61]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[61]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[62]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[62]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[63]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[63]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[6]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[6]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[7]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[7]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[8]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[8]}]
set_input_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {timestamp[9]}]
set_input_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {timestamp[9]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {can_tx}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {can_tx}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[0]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[0]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[10]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[10]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[11]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[11]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[12]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[12]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[13]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[13]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[14]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[14]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[15]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[15]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[16]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[16]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[17]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[17]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[18]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[18]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[19]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[19]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[1]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[1]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[20]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[20]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[21]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[21]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[22]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[22]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[23]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[23]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[24]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[24]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[25]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[25]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[26]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[26]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[27]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[27]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[28]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[28]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[29]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[29]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[2]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[2]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[30]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[30]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[31]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[31]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[3]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[3]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[4]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[4]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[5]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[5]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[6]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[6]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[7]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[7]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[8]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[8]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {data_out[9]}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {data_out[9]}]
set_output_delay 3.5000 -clock [get_clocks {clk}] -min -add_delay [get_ports {int_}]
set_output_delay 4.5000 -clock [get_clocks {clk}] -max -add_delay [get_ports {int_}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.2000 [get_ports {can_tx}]
set_load -pin_load 0.2000 [get_ports {int_}]
set_load -pin_load 0.2000 [get_ports {data_out[31]}]
set_load -pin_load 0.2000 [get_ports {data_out[30]}]
set_load -pin_load 0.2000 [get_ports {data_out[29]}]
set_load -pin_load 0.2000 [get_ports {data_out[28]}]
set_load -pin_load 0.2000 [get_ports {data_out[27]}]
set_load -pin_load 0.2000 [get_ports {data_out[26]}]
set_load -pin_load 0.2000 [get_ports {data_out[25]}]
set_load -pin_load 0.2000 [get_ports {data_out[24]}]
set_load -pin_load 0.2000 [get_ports {data_out[23]}]
set_load -pin_load 0.2000 [get_ports {data_out[22]}]
set_load -pin_load 0.2000 [get_ports {data_out[21]}]
set_load -pin_load 0.2000 [get_ports {data_out[20]}]
set_load -pin_load 0.2000 [get_ports {data_out[19]}]
set_load -pin_load 0.2000 [get_ports {data_out[18]}]
set_load -pin_load 0.2000 [get_ports {data_out[17]}]
set_load -pin_load 0.2000 [get_ports {data_out[16]}]
set_load -pin_load 0.2000 [get_ports {data_out[15]}]
set_load -pin_load 0.2000 [get_ports {data_out[14]}]
set_load -pin_load 0.2000 [get_ports {data_out[13]}]
set_load -pin_load 0.2000 [get_ports {data_out[12]}]
set_load -pin_load 0.2000 [get_ports {data_out[11]}]
set_load -pin_load 0.2000 [get_ports {data_out[10]}]
set_load -pin_load 0.2000 [get_ports {data_out[9]}]
set_load -pin_load 0.2000 [get_ports {data_out[8]}]
set_load -pin_load 0.2000 [get_ports {data_out[7]}]
set_load -pin_load 0.2000 [get_ports {data_out[6]}]
set_load -pin_load 0.2000 [get_ports {data_out[5]}]
set_load -pin_load 0.2000 [get_ports {data_out[4]}]
set_load -pin_load 0.2000 [get_ports {data_out[3]}]
set_load -pin_load 0.2000 [get_ports {data_out[2]}]
set_load -pin_load 0.2000 [get_ports {data_out[1]}]
set_load -pin_load 0.2000 [get_ports {data_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_16 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk_sys}]
set_input_transition -rise -max 0.2000 [get_ports {can_rx}]
set_input_transition -fall -max 0.2000 [get_ports {can_rx}]
set_input_transition -rise -max 0.2000 [get_ports {clk_sys}]
set_input_transition -fall -max 0.2000 [get_ports {clk_sys}]
set_input_transition -rise -max 0.2000 [get_ports {res_n}]
set_input_transition -fall -max 0.2000 [get_ports {res_n}]
set_input_transition -rise -max 0.2000 [get_ports {scs}]
set_input_transition -fall -max 0.2000 [get_ports {scs}]
set_input_transition -rise -max 0.2000 [get_ports {srd}]
set_input_transition -fall -max 0.2000 [get_ports {srd}]
set_input_transition -rise -max 0.2000 [get_ports {swr}]
set_input_transition -fall -max 0.2000 [get_ports {swr}]
set_input_transition -rise -max 0.2000 [get_ports {adress[15]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[15]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[14]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[14]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[13]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[13]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[12]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[12]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[11]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[11]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[10]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[10]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[9]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[9]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[8]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[8]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[7]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[7]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[6]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[6]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[5]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[5]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[4]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[4]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[3]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[3]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[2]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[2]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[1]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[1]}]
set_input_transition -rise -max 0.2000 [get_ports {adress[0]}]
set_input_transition -fall -max 0.2000 [get_ports {adress[0]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[31]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[31]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[30]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[30]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[29]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[29]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[28]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[28]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[27]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[27]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[26]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[26]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[25]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[25]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[24]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[24]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[23]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[23]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[22]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[22]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[21]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[21]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[20]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[20]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[19]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[19]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[18]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[18]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[17]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[17]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[16]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[16]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[15]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[15]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[14]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[14]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[13]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[13]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[12]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[12]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[11]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[11]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[10]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[10]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[9]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[9]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[8]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[8]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[7]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[7]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[6]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[6]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[5]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[5]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[4]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[4]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[3]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[3]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[2]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[2]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[1]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[1]}]
set_input_transition -rise -max 0.2000 [get_ports {data_in[0]}]
set_input_transition -fall -max 0.2000 [get_ports {data_in[0]}]
set_input_transition -rise -max 0.2000 [get_ports {sbe[3]}]
set_input_transition -fall -max 0.2000 [get_ports {sbe[3]}]
set_input_transition -rise -max 0.2000 [get_ports {sbe[2]}]
set_input_transition -fall -max 0.2000 [get_ports {sbe[2]}]
set_input_transition -rise -max 0.2000 [get_ports {sbe[1]}]
set_input_transition -fall -max 0.2000 [get_ports {sbe[1]}]
set_input_transition -rise -max 0.2000 [get_ports {sbe[0]}]
set_input_transition -fall -max 0.2000 [get_ports {sbe[0]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[63]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[63]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[62]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[62]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[61]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[61]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[60]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[60]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[59]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[59]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[58]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[58]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[57]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[57]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[56]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[56]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[55]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[55]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[54]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[54]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[53]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[53]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[52]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[52]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[51]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[51]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[50]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[50]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[49]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[49]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[48]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[48]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[47]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[47]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[46]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[46]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[45]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[45]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[44]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[44]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[43]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[43]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[42]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[42]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[41]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[41]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[40]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[40]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[39]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[39]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[38]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[38]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[37]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[37]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[36]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[36]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[35]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[35]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[34]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[34]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[33]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[33]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[32]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[32]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[31]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[31]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[30]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[30]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[29]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[29]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[28]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[28]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[27]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[27]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[26]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[26]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[25]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[25]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[24]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[24]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[23]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[23]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[22]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[22]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[21]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[21]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[20]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[20]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[19]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[19]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[18]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[18]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[17]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[17]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[16]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[16]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[15]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[15]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[14]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[14]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[13]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[13]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[12]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[12]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[11]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[11]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[10]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[10]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[9]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[9]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[8]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[8]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[7]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[7]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[6]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[6]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[5]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[5]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[4]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[4]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[3]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[3]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[2]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[2]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[1]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[1]}]
set_input_transition -rise -max 0.2000 [get_ports {timestamp[0]}]
set_input_transition -fall -max 0.2000 [get_ports {timestamp[0]}]
set_timing_derate -early 0.9350
set_timing_derate -late 1.0650
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
