###############################################################################
# Created by write_sdc
###############################################################################
current_design usb_cdc_wrapper_ahbl
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name HCLK -period 36.0000 [get_ports {HCLK}]
set_clock_transition 0.1500 [get_clocks {HCLK}]
set_clock_uncertainty 0.1500 HCLK
set_propagated_clock [get_clocks {HCLK}]
create_clock -name usb_clk -period 18.0000 [get_ports {usb_cdc_clk_48MHz}]
set_clock_transition 0.1500 [get_clocks {usb_clk}]
set_clock_uncertainty 0.1500 usb_clk
set_propagated_clock [get_clocks {usb_clk}]
set_clock_latency -source -min 3.0000 [get_clocks {HCLK}]
set_clock_latency -source -max 4.5000 [get_clocks {HCLK}]
set_clock_latency -source -min 2.5000 [get_clocks {usb_clk}]
set_clock_latency -source -max 5.5000 [get_clocks {usb_clk}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[0]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[0]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[10]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[10]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[11]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[11]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[12]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[12]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[13]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[13]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[14]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[14]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[15]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[15]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[16]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[16]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[17]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[17]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[18]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[18]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[19]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[19]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[1]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[1]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[20]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[20]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[21]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[21]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[22]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[22]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[23]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[23]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[24]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[24]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[25]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[25]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[26]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[26]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[27]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[27]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[28]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[28]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[29]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[29]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[2]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[2]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[30]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[30]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[31]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[31]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[3]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[3]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[4]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[4]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[5]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[5]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[6]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[6]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[7]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[7]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[8]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[8]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HADDR[9]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HADDR[9]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HREADY}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HREADY}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRESETn}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRESETn}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HSEL}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HSEL}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HSIZE[0]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HSIZE[0]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HSIZE[1]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HSIZE[1]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HSIZE[2]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HSIZE[2]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HTRANS[0]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HTRANS[0]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HTRANS[1]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HTRANS[1]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[0]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[0]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[10]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[10]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[11]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[11]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[12]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[12]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[13]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[13]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[14]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[14]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[15]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[15]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[16]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[16]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[17]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[17]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[18]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[18]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[19]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[19]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[1]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[1]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[20]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[20]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[21]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[21]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[22]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[22]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[23]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[23]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[24]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[24]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[25]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[25]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[26]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[26]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[27]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[27]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[28]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[28]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[29]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[29]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[2]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[2]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[30]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[30]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[31]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[31]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[3]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[3]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[4]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[4]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[5]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[5]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[6]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[6]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[7]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[7]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[8]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[8]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWDATA[9]}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWDATA[9]}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HWRITE}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HWRITE}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {dn_rx_i}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {dn_rx_i}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {dp_rx_i}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {dp_rx_i}]
set_input_delay 2.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {usb_cdc_clk_48MHz}]
set_input_delay 5.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {usb_cdc_clk_48MHz}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[0]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[0]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[10]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[10]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[11]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[11]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[12]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[12]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[13]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[13]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[14]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[14]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[15]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[15]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[16]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[16]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[17]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[17]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[18]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[18]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[19]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[19]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[1]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[1]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[20]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[20]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[21]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[21]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[22]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[22]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[23]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[23]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[24]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[24]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[25]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[25]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[26]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[26]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[27]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[27]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[28]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[28]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[29]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[29]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[2]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[2]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[30]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[30]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[31]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[31]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[3]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[3]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[4]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[4]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[5]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[5]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[6]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[6]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[7]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[7]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[8]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[8]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HRDATA[9]}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HRDATA[9]}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {HREADYOUT}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {HREADYOUT}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {dn_tx_o}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {dn_tx_o}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {dp_pu_o}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {dp_pu_o}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {dp_tx_o}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {dp_tx_o}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {irq}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {irq}]
set_output_delay 3.0000 -clock [get_clocks {HCLK}] -min -add_delay [get_ports {tx_en_o}]
set_output_delay 10.0000 -clock [get_clocks {HCLK}] -max -add_delay [get_ports {tx_en_o}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0750 [get_ports {HREADYOUT}]
set_load -pin_load 0.0750 [get_ports {dn_tx_o}]
set_load -pin_load 0.0750 [get_ports {dp_pu_o}]
set_load -pin_load 0.0750 [get_ports {dp_tx_o}]
set_load -pin_load 0.0750 [get_ports {irq}]
set_load -pin_load 0.0750 [get_ports {tx_en_o}]
set_load -pin_load 0.0750 [get_ports {HRDATA[31]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[30]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[29]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[28]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[27]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[26]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[25]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[24]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[23]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[22]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[21]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[20]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[19]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[18]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[17]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[16]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[15]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[14]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[13]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[12]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[11]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[10]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[9]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[8]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[7]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[6]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[5]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[4]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[3]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[2]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[1]}]
set_load -pin_load 0.0750 [get_ports {HRDATA[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_16 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {HCLK}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_16 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {usb_cdc_clk_48MHz}]
set_input_transition 0.5000 [get_ports {HCLK}]
set_input_transition 0.5000 [get_ports {HREADY}]
set_input_transition 0.5000 [get_ports {HRESETn}]
set_input_transition 0.5000 [get_ports {HSEL}]
set_input_transition 0.5000 [get_ports {HWRITE}]
set_input_transition 0.5000 [get_ports {dn_rx_i}]
set_input_transition 0.5000 [get_ports {dp_rx_i}]
set_input_transition 0.5000 [get_ports {usb_cdc_clk_48MHz}]
set_input_transition 0.5000 [get_ports {HADDR[31]}]
set_input_transition 0.5000 [get_ports {HADDR[30]}]
set_input_transition 0.5000 [get_ports {HADDR[29]}]
set_input_transition 0.5000 [get_ports {HADDR[28]}]
set_input_transition 0.5000 [get_ports {HADDR[27]}]
set_input_transition 0.5000 [get_ports {HADDR[26]}]
set_input_transition 0.5000 [get_ports {HADDR[25]}]
set_input_transition 0.5000 [get_ports {HADDR[24]}]
set_input_transition 0.5000 [get_ports {HADDR[23]}]
set_input_transition 0.5000 [get_ports {HADDR[22]}]
set_input_transition 0.5000 [get_ports {HADDR[21]}]
set_input_transition 0.5000 [get_ports {HADDR[20]}]
set_input_transition 0.5000 [get_ports {HADDR[19]}]
set_input_transition 0.5000 [get_ports {HADDR[18]}]
set_input_transition 0.5000 [get_ports {HADDR[17]}]
set_input_transition 0.5000 [get_ports {HADDR[16]}]
set_input_transition 0.5000 [get_ports {HADDR[15]}]
set_input_transition 0.5000 [get_ports {HADDR[14]}]
set_input_transition 0.5000 [get_ports {HADDR[13]}]
set_input_transition 0.5000 [get_ports {HADDR[12]}]
set_input_transition 0.5000 [get_ports {HADDR[11]}]
set_input_transition 0.5000 [get_ports {HADDR[10]}]
set_input_transition 0.5000 [get_ports {HADDR[9]}]
set_input_transition 0.5000 [get_ports {HADDR[8]}]
set_input_transition 0.5000 [get_ports {HADDR[7]}]
set_input_transition 0.5000 [get_ports {HADDR[6]}]
set_input_transition 0.5000 [get_ports {HADDR[5]}]
set_input_transition 0.5000 [get_ports {HADDR[4]}]
set_input_transition 0.5000 [get_ports {HADDR[3]}]
set_input_transition 0.5000 [get_ports {HADDR[2]}]
set_input_transition 0.5000 [get_ports {HADDR[1]}]
set_input_transition 0.5000 [get_ports {HADDR[0]}]
set_input_transition 0.5000 [get_ports {HSIZE[2]}]
set_input_transition 0.5000 [get_ports {HSIZE[1]}]
set_input_transition 0.5000 [get_ports {HSIZE[0]}]
set_input_transition 0.5000 [get_ports {HTRANS[1]}]
set_input_transition 0.5000 [get_ports {HTRANS[0]}]
set_input_transition 0.5000 [get_ports {HWDATA[31]}]
set_input_transition 0.5000 [get_ports {HWDATA[30]}]
set_input_transition 0.5000 [get_ports {HWDATA[29]}]
set_input_transition 0.5000 [get_ports {HWDATA[28]}]
set_input_transition 0.5000 [get_ports {HWDATA[27]}]
set_input_transition 0.5000 [get_ports {HWDATA[26]}]
set_input_transition 0.5000 [get_ports {HWDATA[25]}]
set_input_transition 0.5000 [get_ports {HWDATA[24]}]
set_input_transition 0.5000 [get_ports {HWDATA[23]}]
set_input_transition 0.5000 [get_ports {HWDATA[22]}]
set_input_transition 0.5000 [get_ports {HWDATA[21]}]
set_input_transition 0.5000 [get_ports {HWDATA[20]}]
set_input_transition 0.5000 [get_ports {HWDATA[19]}]
set_input_transition 0.5000 [get_ports {HWDATA[18]}]
set_input_transition 0.5000 [get_ports {HWDATA[17]}]
set_input_transition 0.5000 [get_ports {HWDATA[16]}]
set_input_transition 0.5000 [get_ports {HWDATA[15]}]
set_input_transition 0.5000 [get_ports {HWDATA[14]}]
set_input_transition 0.5000 [get_ports {HWDATA[13]}]
set_input_transition 0.5000 [get_ports {HWDATA[12]}]
set_input_transition 0.5000 [get_ports {HWDATA[11]}]
set_input_transition 0.5000 [get_ports {HWDATA[10]}]
set_input_transition 0.5000 [get_ports {HWDATA[9]}]
set_input_transition 0.5000 [get_ports {HWDATA[8]}]
set_input_transition 0.5000 [get_ports {HWDATA[7]}]
set_input_transition 0.5000 [get_ports {HWDATA[6]}]
set_input_transition 0.5000 [get_ports {HWDATA[5]}]
set_input_transition 0.5000 [get_ports {HWDATA[4]}]
set_input_transition 0.5000 [get_ports {HWDATA[3]}]
set_input_transition 0.5000 [get_ports {HWDATA[2]}]
set_input_transition 0.5000 [get_ports {HWDATA[1]}]
set_input_transition 0.5000 [get_ports {HWDATA[0]}]
set_timing_derate -early 0.9200
set_timing_derate -late 1.0800
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
